<a href="https://colab.research.google.com/github/ClauderCarvalho/ABERTO/blob/master/CRIANDO_UM_DATASET_ATRAVEZ_DE_UMA_BIBLIOTECA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Estruturas de Dados em Pandas



pandas.Series()          - 1 Dimensão  - 1D

pandas.DataFrame()  - 2 Dimensões - 2D

pandas.Panel()           - 3 Dimensões - 3D

numpy.ndarray()     - x Dimensões

# DataFrames

In [0]:
import pandas as pd
import numpy as np

In [0]:
#Criando um dicionario

stock = {'AMZN': pd.Series([346.15,0.59,459,0.52,589.8,158.88],
                           index = ['Closing price','EPS','Shares Outstanding(M)', 
                                  'Beta', 'P/E','Market Cap(B)']),
         'GOOG': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64],
                            index = ['Closing price','EPS','Shares Outstanding(M)',
                                  'Beta','P/E','Market Cap(B)']),
         'FB': pd.Series([61.48,0.59,2450,104.93,150.92],
                            index = ['Closing price','EPS','Shares Outstanding(M)',
                                  'P/E', 'Market Cap(B)']),
         'YHOO': pd.Series([34.90,1.27,1010,27.48,0.66,35.36],
                            index=['Closing price','EPS','Shares Outstanding(M)',
                                  'P/E','Beta', 'Market Cap(B)']),
         'TWTR':pd.Series([65.25,-0.3,555.2,36.23],
                            index=['Closing price','EPS','Shares Outstanding(M)',
                                  'Market Cap(B)']),
         'AAPL':pd.Series([501.53,40.32,892.45,12.44,447.59,0.84],
                            index=['Closing price','EPS','Shares Outstanding(M)','P/E',
                                  'Market Cap(B)','Beta'])}

In [0]:
type(stock)

dict

In [0]:
stock_df = pd.DataFrame(stock) # Converter para um dataframe

In [0]:
stock_df

                         AMZN     GOOG       FB     YHOO    TWTR    AAPL
Beta                     0.52     0.87      NaN     0.66     NaN    0.84
Closing price          346.15  1133.43    61.48    34.90   65.25  501.53
EPS                      0.59    36.05     0.59     1.27   -0.30   40.32
Market Cap(B)          158.88   380.64   150.92    35.36   36.23  447.59
P/E                    589.80    31.44   104.93    27.48     NaN   12.44
Shares Outstanding(M)  459.00   335.83  2450.00  1010.00  555.20  892.45

In [0]:
#TRANSFORMADO OS NOMES EM INDEX, 

stock_df = pd.DataFrame(stock,  
                        index = ['Closing price',
                                 'EPS', 
                                 'Shares Outstanding(M)',
                                 'P/E', 
                                 'Market Cap(B)',
                                 'Beta'])

In [0]:
stock_df

                         AMZN     GOOG       FB     YHOO    TWTR    AAPL
Closing price          346.15  1133.43    61.48    34.90   65.25  501.53
EPS                      0.59    36.05     0.59     1.27   -0.30   40.32
Shares Outstanding(M)  459.00   335.83  2450.00  1010.00  555.20  892.45
P/E                    589.80    31.44   104.93    27.48     NaN   12.44
Market Cap(B)          158.88   380.64   150.92    35.36   36.23  447.59
Beta                     0.52     0.87      NaN     0.66     NaN    0.84

In [0]:

#SELECIONAR ALGUMAS COLUNAS DO DATAFRAME
stock_df = pd.DataFrame(stock,
                        index = ['Closing price',
                                 'EPS',
                                 'Shares Outstanding(M)',
                                 'P/E', 
                                 'Market Cap(B)',
                                 'Beta'],
                        columns = ['FB','TWTR','SCNW'])

In [0]:
stock_df

                            FB    TWTR SCNW
Closing price            61.48   65.25  NaN
EPS                       0.59   -0.30  NaN
Shares Outstanding(M)  2450.00  555.20  NaN
P/E                     104.93     NaN  NaN
Market Cap(B)           150.92   36.23  NaN
Beta                       NaN     NaN  NaN

In [0]:
#mOSTAR O INDEX DO DATAFRAME
stock_df.index

Index(['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)',
       'Beta'],
      dtype='object')

In [0]:
#Mostrar os nomes das colunas
stock_df.columns

Index(['FB', 'TWTR', 'SCNW'], dtype='object')

##CRIAR OUTRO DATAFRAME = OLIMPIADAS =  Operações com DataFrames

In [0]:
Quadro_Medalhas_Olimpiada = {
    'USA' : {'Ouro':46, 'Prata':37, 'Bronze':38},
    'China':{'Ouro':26, 'Prata':18, 'Bronze':26},
    'Britain':{'Ouro':27, 'Prata':23, 'Bronze':17},
    'Russe':{'Ouro':19, 'Prata':18, 'Bronze':19},
    'Germany':{'Ouro':17, 'Prata':10, 'Bronze':15}}

In [0]:
# cONVERTER O DICIONARIO EM UM DATAFRAME
olimpiada = pd.DataFrame.from_dict(Quadro_Medalhas_Olimpiada)

In [0]:
olimpiada

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

In [0]:
type(olimpiada)

pandas.core.frame.DataFrame

In [0]:
Medalhas_China = olimpiada['China']

In [0]:
Medalhas_China

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [0]:
olimpiada['China']

Bronze    26
Ouro      26
Prata     18
Name: China, dtype: int64

In [0]:
olimpiada.Russe

Bronze    19
Ouro      19
Prata     18
Name: Russe, dtype: int64

In [0]:
olimpiada[['Russe','Germany']]

        Russe  Germany
Ouro       19       17
Prata      18       10
Bronze     19       15

In [0]:
olimpiada.get('Germany')# gET A COLUNA QUE EU QUERO RETORNAR

Ouro      17
Prata     10
Bronze    15
Name: Germany, dtype: int64

In [0]:
olimpiada

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

In [0]:
type(olimpiada)

pandas.core.frame.DataFrame

In [0]:
# iloc BUSCA ATRAVES DO INDEX
olimpiada.iloc[1]

USA        37
China      18
Britain    23
Russe      18
Germany    10
Name: Prata, dtype: int64

## Slicing

In [0]:
olimpiada

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

In [0]:
olimpiada[:2]

       USA  China  Britain  Russe  Germany
Ouro    46     26       27     19       17
Prata   37     18       23     18       10

In [0]:
olimpiada[2:]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15

In [0]:
olimpiada[::2]

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Bronze   38     26       17     19       15

In [0]:
olimpiada[::-1]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15
Prata    37     18       23     18       10
Ouro     46     26       27     19       17

In [0]:
olimpiada

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

## Slicing por indexação

In [0]:
olimpiada.loc['Ouro']

USA        46
China      26
Britain    27
Russe      19
Germany    17
Name: Ouro, dtype: int64

In [0]:
olimpiada.loc[:,'USA']

Bronze    38
Ouro      46
Prata     37
Name: USA, dtype: int64

In [0]:
olimpiada.loc['Prata','China']

18

In [0]:
olimpiada.loc['Prata']['China']

18

In [0]:
olimpiada.loc['Prata']

USA        37
China      18
Britain    23
Russe      18
Germany    10
Name: Prata, dtype: int64

In [0]:
olimpiada.loc['Ouro'] > 20

USA         True
China       True
Britain     True
Russe      False
Germany    False
Name: Ouro, dtype: bool

In [0]:
olimpiada.loc[:, olimpiada.loc['Ouro'] > 20]

        USA  China  Britain
Ouro     46     26       27
Prata    37     18       23
Bronze   38     26       17

In [0]:
olimpiada.loc['Prata'] > 20

USA         True
China      False
Britain     True
Russe      False
Germany    False
Name: Prata, dtype: bool

In [0]:
olimpiada.iloc[:2] # iloc = ATRAVES DO INDEX

       USA  China  Britain  Russe  Germany
Ouro    46     26       27     19       17
Prata   37     18       23     18       10

In [0]:
olimpiada.iloc[2,0:2]

USA      38
China    26
Name: Bronze, dtype: int64

In [0]:
olimpiada.iloc[2:3, :]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15

In [0]:
olimpiada.iloc[1,:]

USA        37
China      18
Britain    23
Russe      18
Germany    10
Name: Prata, dtype: int64

In [0]:
olimpiada.iloc[2, 0]

37

## Removendo um membro do dataframe

In [0]:
del olimpiada['USA']

KeyError: ignored

In [0]:
olimpiada

        China  Britain  Russe  Germany
Ouro       26       27     19       17
Prata      18       23     18       10
Bronze     26       17     19       15

## Inserindo um membro no dataframe

In [0]:
#Inserir uma coluna no dataframe

olimpiada.insert(0, 'Brasil', (7, 6, 6))

ValueError: ignored

In [0]:
olimpiada

        Brasil  China  Britain  Russe  Germany
Ouro         7     26       27     19       17
Prata        6     18       23     18       10
Bronze       6     26       17     19       15

## Resumo do dataframe

In [0]:
# Resumo estatistico dos dados
olimpiada.describe()

         Brasil      China    Britain      Russe    Germany
count  3.000000   3.000000   3.000000   3.000000   3.000000
mean   6.333333  23.333333  22.333333  18.666667  14.000000
std    0.577350   4.618802   5.033223   0.577350   3.605551
min    6.000000  18.000000  17.000000  18.000000  10.000000
25%    6.000000  22.000000  20.000000  18.500000  12.500000
50%    6.000000  26.000000  23.000000  19.000000  15.000000
75%    6.500000  26.000000  25.000000  19.000000  16.000000
max    7.000000  26.000000  27.000000  19.000000  17.000000

# Fim